{
  "title": "Gian Paul Ramirez",
  "subtitle": "THE CURIOUS CODEWRIGHT",
  "avatar": "/images/avatar.jpg",
  "resume": "/resume/Gian-Paul-Ramirez.pdf",
  "github": "https://github.com/paul-rl",
  "contactMe": "mailto:gpaul.rl7@gmail.com",
  "projects": [
    {
      "title": "Groundbreak",
      "image": "/images/projects/groundbreak.gif",
      "description": "What if the arena itself were your arsenal? Groundbreak is a roguelike tactics RPG where you sling elemental tiles to trigger reactions such as sandstorms and fireballs to escape a multi-floor dungeon. As part of a four-person team, I led combat design, building the tile-flinging mechanics, elemental reaction system, and enemy AI powered by A* pathfinding. The most rewarding part was playtesting with over ten players to balance the elements and create diverse, fun build paths. (RIP Sandstorm)",
      "tags": {
        "tag-1": "Unity",
        "tag-2": "C#",
        "tag-3": "Playtesting",
        "tag-4": "Game Balance",
        "tag-5": "Plastic SCM"
      },
      "link": "https://github.com/paul-rl/Groundbreak/"
    },
    {
      "title": "Keystone",
      "image": "/images/projects/keystone.jpg",
      "description": "What if NPCs were the puzzle pieces? Keystone is an open-world adventure where NPC behaviors intertwine. By herding, distracting, trading aggro, and luring enemies, players uncover hidden paths and secrets woven into the world’s ecosystem. It was my first time working in a cross-functional team; I quickly learned how to share a vision, designing six dungeons based on settings created by our artist. I also built a choose-your-own-adventure prototype to test puzzle flow early in development.",
      "tags": {
        "tag-1": "Prototyping",
        "tag-2": "Twilio",
        "tag-3": "Game Balancing",
        "tag-4": "Cross-functional Team"
      },
      "link": "/files/keystone_gdd.pdf"
    },
    {
      "title": "Fakeflix",
      "image": "/images/projects/fakeflix.png",
      "description": "FakeFlix was my first real dive into front-end development. I expanded a React/Redux codebase with 35k+ lines of code  to add a “Because You Watched” recommendations rail and build new reusable UI components. It was a crash course in how React and Redux intertwine to handle complex state, and it was satisfying to make interfaces feel as good as they look. I also dipped my toes into DevOps for the first time, setting up GitHub Actions to automate testing and keep the codebase stable.",
      "tags": {
        "tag-1": "TypeScript",
        "tag-2": "React/Redux",
        "tag-3": "CI/CD",
        "tag-4": "GitHub Actions"
      },
      "link": "https://github.com/UCF-CEN-5016/sde-project-works-on-my-machine"
    },
    {
      "title": "Steam Recommendation Engine",
      "image": "/images/projects/steam.jpg",
      "description": "A peek behind Steam's discovery queue turned hands-on ML lab. I built a sequence-aware recommender with a SASRec Transformer and learned the habits that make an impact: evaluating on a store-like slate, keeping histories chronological, and using careful masking to prevent leakage. From there, the fun was in tinkering: swapping signals, rerunning vectorized scorers, and watching the rankings shift. Turns out raw counts can be problematic, but normalization is magical.",
      "tags": {
        "tag-1": "PyTorch",
        "tag-2": "Transformers (SASRec)",
        "tag-3": "NumPy",
        "tag-4": "Sequential Recommendation"
      },
      "link": "https://github.com/paul-rl/Steam-Recommendation-Engine"
    },
    {
      "title": "Personal Website",
      "image": "/images/projects/header.png",
      "description": "You’re on it! Designed in Figma and built with Next.js, React, and Tailwind CSS, it began as a way to challenge myself to grow in the field of front-end development. A passion project inspired by League of Legends’ champion pages, I wanted to create a site where every element looked and felt straight out of League. I focused on dealing with different aspect ratios to create a hassle-free experience no matter what device you're on. Now, it's my hub for showcasing projects and the things I love the most.",
      "tags": {
        "tag-1": "TypeScript",
        "tag-2": "React",
        "tag-3": "Tailwind CSS",
        "tag-4": "Next.js"
      },
      "link": "https://github.com/paul-rl/personal-website-v2"
    }
  ],
  "hobbies": [
    {
      "title": "Album Club",
      "image": "/images/hobbies/album.png",
      "description": "Music is magical, and I can never listen to enough. My friends and I love sharing music with each other, to the point where we started an Album club. Each week, one of us picks an album none of us have listened to before, and we share our thoughts and review it. It's an incredibly fun way to discover music I might never have found otherwise. Despite my general preference for alternative music, I realized that girl pop has a special place in my heart; Brat and Imaginal Disk are phenomenal albums."
    },
    {
      "title": "Fighting Games",
      "image": "/images/hobbies/fight.png",
      "description": "Nine-year-old me loved rolling under fireballs as Abel and low-checking friends while sliding across the screen with Sub-Zero. That love never died. I had a hint of the mind games as a kid, but when FighterZ launched in 2018 I dove headfirst. Since then, I haven't stopped: Guilty Gear, SF6 and now 2XKO. There's nothing more satisfying than throwing your opponent 4 times in a row to end the round, labbing some vile oki, and landing some shroomloops after hours practicing."
    },
    {
      "title": "Live Music",
      "image": "/images/hobbies/concert.png",
      "description": "My first concert was BROCKHAMPTON in a small venue in 2019. Since, I've been hooked. Rock, Jazz, Reggeaton, the genre doesn't matter. Music is like a religion to me, and live music is church. There's no feeling quite like sharing a room with thousands of people, all singing and celebrating their love for music. So far, I've been really lucky to see some of my favorite artists: Red Hot Chilli Peppers, Tyler, The Creator, My Chemical Romance, and Spellling. I'm beyond excited to check out a festival this coming year."
    }
  ]
}
